Revit 2027 API
FilteredWorksetIdIterator.GetCurrent Method
 The current workset id found by the iterator.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public WorksetId GetCurrent()
Public Function GetCurrent As WorksetId
public:
WorksetId^ GetCurrent()
member GetCurrent : unit -> WorksetId
Return Value
WorksetId
 The workset id.
Exceptions
Exception | Condition
InvalidOperationException |  There are no more workset ids in the iterator. -or- The FilteredWorksetCollector that yielded this iterator has been reset by another operation. No further iteration is permitted with this iterator.
See Also
Reference
FilteredWorksetIdIterator Class
Autodesk.Revit.DB Namespace